"""
Дана строка, состоящая из русских слов,
разделенных пробелами (одним или несколькими).
Вывести строку, содержащую эти же слова,
разделенные одним пробелом и расположенные в обратном порядке.
"""
def reverse_words(text):
    #Разделяем строку на слова (множественные пробелы игнорируются)
    words = text.split()
    #Меняем слова местами
    reverse_words = list(reversed(words))
    #Возвращаем слова с пробелом
    return ' '.join(reverse_words)
#Вызываем функцию
print(reverse_words("один два три"))
print(reverse_words("Hello World "))
