#Найти и вывести на экран квадраты и кубы чисел от 2 до 5.
num1, num2, num3, num4 = 2, 3, 4, 5
num1 **= 2
num2 **= 2
num3 **= 2
num4 **= 2
print("Числа возведенные в квадрат:", num1, num2, num3, num4)
num1, num2, num3, num4 = 2, 3, 4, 5
num1 **= 3
num2 **= 3
num3 **= 3
num4 **= 3
print("Числа возведенные в куб:", num1, num2, num3, num4)